---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveArray.Item(System.Int32)
source: html/1ec24cf4-66f6-8acc-4cb7-93cf659199d4.htm
---
# Autodesk.Revit.DB.ModelCurveArray.Item Property

Gets or sets a model curve at a specified index within the array.

## Syntax (C#)
```csharp
public virtual ModelCurve this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the model curve to be set or retrieved.

## Returns
Returns the model curve at the specified index.